# Даны списки:
# a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89];
# b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13].
# Нужно вернуть список, который состоит из элементов, общих для
# этих двух списков.
# Решение - Через цикл

a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]
common_elements = []

for num in a:
    if num in b and num not in common_elements:
        common_elements.append(num)

print(common_elements)  # Вывод: [1, 2, 3, 5, 8, 13]