# Даны списки:
# a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89];
# b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13].
# Нужно вернуть список, который состоит из элементов, общих для
# этих двух списков.
# Решение - list comprehension

a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]

# Выбираем элементы из 'a', которые есть в 'b', и убираем дубли через 'not in'
common_elements = [x for i, x in enumerate(a) if x in b and x not in a[:i]]

print(common_elements)  # Вывод: [1, 2, 3, 5, 8, 13]